
# 社会基盤計画学演習第3回レポート
# 学籍番号 11111111
# 名前 XXXXXXX
# 日付 2022.10.24

# 問１ 四則演算
# 以下1～3の演算を実行するコマンドを書き，考察せよ．
# 1
(4*3)+(5*2)

#2
4*(3+5)*2

#3
3^3

#4
# ()を使うと，()内の計算が優先されることがわかる．

#問２ オブジェクトと代入（付値）
#1
x <- (4*3)+(5*1)
x

#2
x <- 4*(3+5)*2
x

#3
# ある値をオブジェクトに代入した後に，別の値を入れると，上書きされる．

# 問3-1 ベクトルの生成
#1
x <- c(1,0,0,0,1,0,0,0,1)
x

#2
y <- rep(1,length=9)
y

#3
z <- c("FukoNakai","1234567")
z

# 問3-2 ベクトルのデータ型
#以下のように調べた結果，それぞれ"double"（実数型），"double"（実数型），"character"（文字列型）となった．
typeof(x)
typeof(y)
typeof(z)

# 問4 行列の生成と操作
#1
matrix(c(1,0,0,0,1,0,0,0,1),nrow = 3, ncol = 3)
matrix(c(1,0,0,0,1,0,0,0,1),nrow = 3, ncol = 3,byrow = T)

#2
matrix(rep(1,length=100),nrow = 10,ncol = 10)
matrix(rep(1,length=100),nrow = 10,ncol = 10,byrow = T)

#3
matrix(c(1:25),nrow = 5, ncol = 5)
matrix(c(1:25),nrow = 5, ncol = 5,byrow = T)

#4
#パラメータ「byrow」は，行列に入れる要素を行（row）優先で入れるかどうかを指定するものです．
#デフォルトでは（つまり，何も指定しなければ）「byrow=F」になり，列優先で要素が埋まります．「byrow=T」とすれば，列優先で要素が埋まります．

# 問5 都市のシミュレーション 

#1
#パッケージのインストール
#install.packages("lpSolve")
library(lpSolve)

#目的関数の係数
fobj <- c(1,2,3,4,7,7,8,9,10)

#制約条件式の左辺の係数の行列A
fconst <- matrix(c(1,4,5,6,7,6,5,4,3,
                   1,1,1,1,1,1,1,1,1,
                   1,0,0,0,0,0,0,0,0,
                   0,1,0,0,0,0,0,0,0,
                   0,0,1,0,0,0,0,0,0,
                   0,0,0,1,0,0,0,0,0,
                   0,0,0,0,1,0,0,0,0,
                   0,0,0,0,0,1,0,0,0,
                   0,0,0,0,0,0,1,0,0,
                   0,0,0,0,0,0,0,1,0,
                   0,0,0,0,0,0,0,0,1),ncol=9,byrow = T)

#制約条件式の不等号ベクトルの設定
fdir <- c(">=","=","<=","<=","<=","<=","<=","<=","<=","<=","<=")

# 制約条件式の右辺のベクトルb 
rrhs <- c(100,200,10,20,10,50,90,100,90,120,110)

#最小化問題を解く
result <- lp("min", # 最小化問題
             fobj, # 目的関数の係数c（numeric型の要素からなるベクトル）
             fconst, # 制約条件式の左辺の係数の行列A （numeric型の要素からなるmatrix）
             fdir, # character型の要素からなるベクトル
             rrhs, # 制約条件式の右辺のベクトルb （numeric型の要素からなるmatrix）
             compute.sens=T ) # 感度分析を行うか

#2
# 最適解における決定変数の値
#x1から順に，10万人，20万人，10万人，50万人，10万人，100万人，0万人，0万人，0万人
result$solution

#3
# 最適解における総津波リスクの値
result$objval

#4
#棒グラフの可視化
barplot(result$solution, # 最適解が入ったベクトル
        names.arg=paste("地域", c(1:length(result$solution))), #x軸のラベル
        main = "最適解における都市の人口配分", #グラフの上部のタイトル
        xlab = "地域名", #x軸のタイトル
        ylab = "人口[万人]" #y軸のタイトル
)